
#include<stdlib.h>
#include<cstdio>
#include<stdlib.h>
#include <cstdio>
#include <iostream>
using namespace std;

// 04-第4章-表达式

/*
	表达式由一个或多个 运算对象 组成,对表达式求值将得到一个结果.
	字面值 和 变量 是最简单的表达式,其结果就是字面值和变量的值.
	把一个运算符和 一个或多个对象组合起来可以生成较复杂的表达式.
*/


//=========================================================================
//
//							4.1 基 础
//
//=========================================================================


// 4.1.1 基本概念 __________________________
/*
	一元运算符 和 二元运算符  

	一些符合既能作为 一元运算符 也能作为 二元运算符 【比如*】
*/


/*	【组合运算符 和 运算对象】
	首先要理解 运算符的 优先级，结合律 以及运算对象的求值顺序。
*/ 

/*	【运算对象转换】
*/ 

/*	【重载运算符】-P121 
	我们使用重载运算符时，其包括运算对象的类型和返回值的类型，都是由该运算符定义的；
	但是运算对象的个数、运算符的优先级 和 结合律 都是无法改变的。
*/ 

/*	【左值和右值】-P121
*/ 

