
#include<stdlib.h>
#include<cstdio>
#include<stdlib.h>
#include <cstdio>
#include <iostream>
using namespace std;

// 09-第9章-顺序容器

/*
	本章是第3章内容的扩展

	顺序容器 为程序员 提供了 控制元素存储和访问顺序的能力。 
	这种顺序不依赖于 元素的值, 而是与元素加入容器时的位置相对应。

	与之相对的，我们将在11章介绍的 有序 和 无序关联容器，则根据 关键字的值 来存储元素。
*/


//=========================================================================
//
//							9.1 顺序容器概述
//
//=========================================================================


// 表 9.1 顺序容器类型 __________________________
/*

*/

