
#include<stdlib.h>
#include<cstdio>
#include<stdlib.h>
#include <cstdio>
#include <iostream>
using namespace std;

#include <algorithm>

// 10-第10章-泛型算法

//=========================================================================
//
//							10.1 概述
//
//=========================================================================

/*
	一般情况下，这些算法并不直接操作容器，而是遍历由两个迭代器指定的一个元素范围来进行操作。
*/

void algorithm_study_open()
{
	int val = 42;
	vector<int> vec (10, 42);
	auto result = find(vec.cbegin(), vec.cend(), val);
}

/*	关键概念：算法永远不会执行容器的操作
	泛型算法本身不会执行容器的操作，它们只会运行于迭代器之上，执行迭代器的操作。

	这样就可知： 算法永远不会改变底层容器的大小。
	算法可能改变容器中保存的元素的值，也可能在容器内移动元素，但永远不会直接添加或删除元素。
*/ 


//=========================================================================
//
//							10.2 初始泛型算法
//
//=========================================================================


// 10.2.1 只读算法 __________________________
/*
	
*/  



  






